Revit 2026 API

# PipeFittingAndAccessoryPressureDropUIDataItem Properties

---

The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

PipeFittingAndAccessoryPressureDropUIDataItem Class

Autodesk.Revit.UI.Plumbing Namespace